ruby/temp/simple_photo/app/controllers/photos_controller.rb

  def create
    @photo = Photo.new(photo_params)

    respond_to do |format|
      if @photo.save
---
INSERT INTO "photos" ("created_at", "description", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Mon, 20 Jan 2014 11:03:35 UTC +00:00], ["description", "John Lui"], ["title", "John"], ["updated_at", Mon, 20 Jan 2014 11:03:35 UTC +00:00]]

  def update
    respond_to do |format|
      if @photo.update(photo_params)
---
UPDATE "photos" SET "description" = $1, "updated_at" = $2 WHERE "photos"."id" = 1  [["description", "John Lui Super"], ["updated_at", Mon, 20 Jan 2014 11:04:00 UTC +00:00]]

  def destroy
    @photo.destroy
---
DELETE FROM "photos" WHERE "photos"."id" = $1  [["id", 2]]